In [0]:
# rewrite/create a file
open('Sales.db', 'w')
from google.colab import files
# download a 0 size file
files.download('Sales.db')

In [0]:
# upload (a previous downloaded file)
from google.colab import files
uploaded = files.upload()

In [0]:
import sqlite3

db_filename = 'Sales.db'
conn = sqlite3.connect(db_filename)

In [0]:
c = conn.cursor()

In [0]:
c.execute('CREATE TABLE Employee (Employee_ID INTEGER PRIMARY KEY, First_Name TEXT, Last_Name TEXT, Department TEXT, City TEXT)')

In [0]:
c.execute("INSERT INTO Employee VALUES (10001, 'Daniel', 'Olson', 'Electronics', 'San Francisco')")

In [0]:
c.execute('SELECT * FROM Employee')
print(c.fetchone())

In [0]:
employees = [
  (10002, 'Nick', 'Markmen', 'Clothes', 'San Francisco'),
  (10003, 'Maria', 'Gonzales', 'Electronics', 'San Jose'),
  (10004, 'George', 'Wong', 'Clothes', 'San Francisco'),
  (10005, 'Stephanie', 'Williams', 'Clothes', 'Oakland'),
  (10006, 'Miguel', 'Alva', 'Clothes', 'Oakland'),
  (10007, 'Jessica', 'Collins',	'Cosmetics', 'San Francisco'),
  (10008, 'Ted', 'Anderson', 'Clothes', 'Oakland'),
  (10009, 'Victoria', 'Garcia', 'Clothes', 'San Jose'),
  (10010, 'Jasmine', 'Khan', 'Pharmacy, Health & Beauty',	'Oakland'),
  (10011, 'Adam',	'Smith', 'Pharmacy, Health & Beauty',	'San Jose'),
  (10012, 'Rachel',	'Kim', 'Electronics', 'San Jose')
]

In [0]:
c.executemany('INSERT INTO Employee VALUES (?,?,?,?,?)', employees)

In [0]:
c.execute('SELECT * FROM Employee')
print(c.fetchall())

In [0]:
c.execute('CREATE TABLE Customer \
  (Customer_ID INTEGER PRIMARY KEY, First_Name TEXT, Last_Name TEXT, City TEXT)')

In [0]:
customers = [
  (20001, 'Jack', 'Ward', 'San Jose'),
  (20002, 'Steven', 'Martinez', 'San Francisco'),
  (20003, 'Jessica', 'Collins', 'San Jose'),
  (20004, 'Carie', 'Robinson', 'San Francisco'),
  (20005, 'Zack', 'Peterson', 'Oakland'),
  (20006, 'Bianca', 'Sanchez', 'San Francisco'),
  (20007, 'James', 'Owen', 'Oakland'),
  (20008, 'Lisa', 'Smith', 'San Francisco'),
  (20009, 'Daniel',	'Yasukawa', 'Oakland'),
  (20010, 'Lauren',	'Pham', 'San Jose'),
  (20011, 'Juan',	'Diaz', 'Oakland'),
  (20012, 'Martha',	'Diaz', 'San Francisco')
]
c.executemany('INSERT INTO Customer VALUES (?,?,?,?)', customers)

In [0]:
c.execute('SELECT * FROM Customer')
print(c.fetchall())

In [0]:
c.execute('CREATE TABLE Product \
  (Product_ID INTEGER PRIMARY KEY, Product_Name TEXT, Price INTEGER, \
  Supplier_ID INTEGER, Supplier_Name TEXT)')

In [0]:
products = [
  (30001, 'T-Shirt', 12.98, 40004, 'Studio Warehouse'),
  (30002, 'Tooth Paste', 4.5, 40002, 'BioMed Inc'),
  (30003, 'Speakers', 56.99, 40005, 'CompTech, Inc'),
  (30004, 'Pants', 34.35, 40003, 'FashionRUs'),
  (30005, 'Microphone', 46.21, 40001, 'Music Vibrations, Inc'),
  (30006, 'Tie', 11.09, 40003, 'FashionRUs'),
  (30007, 'Chap Stick', 3.67, 40002, 'BioMed Inc'),
  (30008, 'Medicine', 23.96, 40002, 'BioMed Inc'),
  (30009, 'Headphones', 31.44, 40001, 'Music Vibrations, Inc'),
  (30010, 'Lotion',	16.77, 40002, 'BioMed Inc'),
  (30011, 'DVD Player',	149.99, 40005, 'CompTech, Inc'),
  (30012, 'Coat',	56.33, 40004, 'Studio Warehouse')
]
c.executemany('INSERT INTO Product VALUES (?,?,?,?,?)', products)

In [0]:
c.execute('CREATE TABLE Orders \
  (Order_ID INTEGER PRIMARY KEY, Customer_ID INTEGER, \
  Product_ID INTEGER, Employee_ID INTEGER, Date TEXT)')

In [0]:
orders = [
  (50001, 20005, 30005, 10001, '17-02-12'),
  (50002, 20003, 30008, 10011, '17-09-03'),
  (50003, 20010, 30001, 10009, '17-11-23'),
  (50004, 20004, 30008, 10010, '17-01-28'),
  (50005, 20008, 30012, 10002, '17-08-11'),
  (50006, 20011, 30011, 10001, '17-04-13'),
  (50007, 20012, 30002, 10007, '17-10-07'),
  (50008, 20002, 30001, 10004, '17-03-09'),
  (50009, 20001, 30006, 10009, '17-12-26'),
]
c.executemany('INSERT INTO Orders VALUES (?,?,?,?,?)', orders)

In [0]:
c.execute('CREATE TABLE Supplier (Supplier_ID INTEGERS PRIMARY KEY, Name TEXT)')

In [0]:
#c.execute('DROP TABLE Supplier')

**Alter table:**

In [0]:
c.execute('ALTER TABLE Supplier ADD City TEXT')

**Insertion:**

In [0]:
suppliers = [
  (40001, 'Music Vibrations, Inc', 'Oakland'),
  (40002, 'BioMed Inc', 'San Francisco'),
  (40003, 'FashionRUs', 'San Jose'),
  (40004, 'Studio Warehouse', 'San Francisco'),
  (40005, 'CompTech, Inc', 'San Jose'),
]
c.executemany('INSERT INTO Supplier VALUES (?,?,?)', suppliers)

**View and query table:**

In [0]:
c.execute('SELECT * FROM Supplier')
print(c.fetchall())

**Update record:**

In [0]:
c.execute("INSERT INTO Supplier VALUES (40006, 'Piper', 'Palo Alto')")

In [0]:
c.execute("UPDATE Supplier SET City = 'San Jose' WHERE Name = 'Piper'")
c.execute('SELECT * FROM Supplier')
print(c.fetchall())

**Delete record:**

In [0]:
c.execute("DELETE FROM Supplier WHERE Name = 'Piper'")
c.execute('SELECT * FROM Supplier')
print(c.fetchall())

**To be continued ... **